# 1. Оставить в списке только чётные числа.
a=1
b=10
data=[x for x in range(a,b+1) if x%2==0]
print(data)

# 2. Сгенерировать список чисел от A до B.
a=1
b=10
data=[x for x in range(a,b+1)]
print(data)

# 3. Сгенерировать список степеней двойки от 0 до n.
n=10
data=[2**i for i in range(n)]
print(data)

# 4. Оставить в списке только строки, полностью состоящие из букв в верхнем регистре.
data=['HELLO','world']
data=[x for x in data if x==x.upper()]
print(data)

# 5. Сгенерировать список вида [1, 2, 2, 3, 3, 3, 4, 4, 4, 4, ..., n, n, n, .., n] для заданного n.
n=5
data=[x for x in range(n+1) for y in range(x)]
print(data)

# 6. Дано число N, сгенерировать таблицу умножения NxN и сохранить в список.
n=5
data=[[x for x in range(n)] for y in range(n)]
for a in range(len(data)):                     #для переменной a в ряду, состоящем из длины массива data
    for b in range(len(data[a])):              #и для переменной b в ряду, состоящем из длины всех переменных a
        data[a][b]=(a+1)*(b+1)                 #массив с номером строки a и номером столбца b преобразовать в такой,
                                               #чтобы каждый символ из строки умножать на соответствующий символ из
                                               #столбца
        print(data[a][b],end=' ')              #вывести таблицу со строками a и столбцами b; если не написать end=' ',
                                               #то он просто выведет все числа в один длинный столбик; если внутри ''
                                               #поставить пробел, то между числами будет стоять пробел
    print()                                    #без этой строки он выводит всё в одну строчку, а не таблицей

# 7. Сгенерировать поле для игры "Сапёр" (посчитать количество мин вокруг каждой из клеток).

# 8. Для заданного N напечатать "змейку".
n=3
data=[x for x in range(1,n+1,)]
for a in range(len(data)):
    print(data[a],end=' ')
print()
data=[x+n for x in range(1,n+1,)]
data2=data[::-1]
for a in range(len(data2)):
    print(data2[a], end=' ')
print()
data=[x+n*2 for x in range(1,n+1,)]
for a in range(len(data)):
    print(data[a],end=' ')
print()

# 9. Для заданного N напечатать таблицу "спиралью".