# 1. Посчитать количество вхождений определенного символа в строку, напечатать процентное содержание символа в строке.
string=input('Enter the string: ')                                    #вводим строку
symbol=input('Enter the symbol: ')                                    #вводим символ, с которым будем работать
print('Quantity of all symbols in string: ',len(string))              #напиши мне количество символов в строке
number=0                                                              #какое-то начальное значение, от которого мы
                                                                      #будем считать количество нужных символов, их 0,
                                                                      #чтобы, перебирая все символы, складывать нужные
for i in string:                                                      #для каждого i (для каждого символа) в этой строке
                                                                      #string выполнить:
    if i==symbol:                                                     #если i (перебираем символы в строке) будет
                                                                      #значить то же самое, что и символ, который мы
                                                                      #ищем
        number+=1                                                     #то считай мне их количество
print('Quantity of symbols searched: ',number)                        #напиши, сколько ты их нашёл
print('Percentage of symbols in string: ',number*100/len(string),'%') #и теперь напиши их процент от всего количества
                                                                      #символов (берём количество*100 и делим на длину
                                                                      #всей строки)

# 2. Дана строка, поменять в ней первый и последний символ.
string=input('Enter the string: ')
print(string[-1]+string[1:-1]+string[0])

# 3. Проверить, что строка состоит только из символов 'a', 'b' и 'c'.
string=input('Enter the string: ') #вводим строку
for i in string:                   #для каждого i (для каждого символа) в этой строке string выполнить:
    if i not in 'abc':             #если i (символ) не входит в abc (если string состоит ещё и из других символов)
        print('Not only "abc"')    #напиши, что там не только abc
        break                      #и остановись, дальше проверять не надо (нет смысла, мы уже и так поняли, что там
                                   #есть другие символы, кроме abc)
    else:                          #в остальных случаях
        print('"abc" only')        #напиши, что там только abc

# 4. Проверить, что строка симметрична относительно центра (палиндром).
string1=input('Enter the string: ')
string2=string1[::-1]
print(string2)
if string1==string2:
    print("It's a palindrome")
else:
    print ("It's not a palindrome")

# 5. Сжать строку по правилу: все последовательности повторяющихся символов длины больше 1 заменить на символ +
# кол-во повторений.
string=input('Enter the string: ')+'$'            #если не написать нечитаемый символ, то он выкинет последние символы и
                                                  #не покажет их
number=0                                          #счётчик текущего символа
result=''                                         #если так не сделать для result, то выдаёт ошибку; result - именно то,
                                                  #что нам надо найти в самом конце (результат)
for i in range(len(string)-1):                    #для каждого i (каждого символа в строке) в ряду, состоящем из длины
                                                  #строки (in string не сработает, потому что тут надо int, а если писать
                                                  #string, то это будет строка (не особо разобралась всё равно)) -1
                                                  #(почему -1 я не поняла) выполнить
    if string[i]!=string[i+1]:                    #если i-тый символ в строке string не равен следующему после него
                                                  #символу
        current_value=(string[number:i+1])        #насколько я поняла, эта переменная отделяет одинаковые символы от
        print(current_value)                      #неодинаковых; берём строку, number в ней считает все одинаковые
                                                  #символы, а когда они заканчиваются, i+1 переводит счётчик number на
                                                  #следующий символ
        result+=string[i]+str(len(current_value)) #увеличиваем result на символ из строки (то есть сначала там ничего не
                                                  #было, а первое, что появится, это первый символ из строки) + длина
                                                  #переменной, записанная не числом, а строкой, потому что не строка не
                                                  #может быть со строкой
        number=i+1                                #перебирает все символы по порядку
print(number)                                     #покажет, сколько он всего насчитал символов
print(result)

# 6. Посчитать сумму элементов списка чисел.
data=[2,5,6,9,3,7,11,25]
print(sum(data))

# 7. Посчитать количество положительных элементов в списке чисел.
# Я сначала случайно посчитала сумму положительных
data1=[2,-6,-4,9,-3,7,3,-5,1]
data2=[]
for i in data:
    if i>=0:
        data2.append(i)
print(sum(data2))
# Это количество
data=[2,-6,-4,9,-3,7,3,-5,1]
number=0
for i in data:
    if i>=0:
        number+=1
print(number)

# 8. Напечатать все чётные элементы списка чисел.
data=[3,6,-9,-5,-3,8,-7,5,2,-1]
for i in data:
    if i%2==0:
        print(i)

# 9. Напечатать все элементы списка чисел, находящиеся на четных позициях (0, 2, 4, ...).
data=[3,6,-9,-5,-3,8,-7,5,2,-1]
print(data[::2])

# 10. Найти среднее арифметическое значение списка чисел.
data=[35,6,98,52,8,76,2,17]
print(sum(data)/len(data))

# 11. Напечатать все строки из списка, длина которых больше 5.
data=['Hi','My name is Nastya','I have a cat','Proxy']
for i in data:
    if len(i)>5:
        print(i)

# 12. Убрать из строки все повторяющиеся символы (любые печатные), заменив их на один символ.
string=input('Enter the string: ')+'$'
number=0
result=''
for i in range(len(string)-1):
    if string[i]!=string[i+1]:
        result+=string[i]
        number=i+1
print(result)

# 13. Заменить все буквы в нижнем регистре на заглавные и наоборот (таблица символов и функция ord() очень помогут).
string=input('Enter the string: ')
result=''
for symbol in string:
    if 'A'<=symbol<='Z':
        result+=chr(ord(symbol)+32) #ord заменяет символ на соответствующее число, а chr - число на символ
    elif 'a'<=symbol<='z':
        result+=chr(ord(symbol)-32)
    else:                           #это делается, чтобы он не менял остальные символы, которые не входят в 'abc' и
        result+=symbol              #'ABC'
print(result)

# 14. Проверить, что список чисел соответствует правилу a1 < a2 > a3 < a4 > a5 ... Другими словами, каждый элемент либо
# строго больше соседей, либо строго меньше.
data=[2,1,3,2,4]
result=True
for i in range(1,len(data)-1): #убираем крайние значения, потому что для них условия проверять не надо
    if data[i-1]>data[i]<data[i+1] or data[i-1]<data[i]>data[i+1]:
        print(result)
        break
    else:
        result=False
        print(result)
        break

# 15. Проверить, что список чисел упорядочен по невозрастанию.
data=[3,2,2,2,1]
result=True
for i in range(len(data)-1):
    if data[i]<data[i+1]:
        result=False
print(result)

# 16. Посчитать разность между суммой элементов на чётных позициях и суммой элементов на нечётных позициях в списке
# чисел.
data=[2,7,5,9,4,1,8]
print(sum(data[::2])-sum(data[1::2]))